var available_words = [
  /* Level 1 */
  ['あおい', 'うえ', 'あかい', 'えき', 'いいえ', 'ここ', 'かく', 'いけ',
  'おおきい', 'きく', 'こえ', 'おおい', 'かお', 'けいこ', 'あい', 'えかき',
  'かう', 'あく', 'ああ', 'いい', 'いう', 'ええ', 'おく', 'かき', 'いく',
  'こい', 'かい', 'あう', 'いえ', 'うえき', 'おか', 'いけ', 'こえ', 'いか',
  'くき', 'きかい', 'おい'],

  /* Level 2 */
  ['おすし', 'おかし', 'うち', 'くつ', 'あそこ', 'せかい', 'おさけ',
  'とけい', 'たかい', 'ちかてつ', 'かさ', 'あつい', 'あさ', 'あし', 'いす',
  'せき', 'そこ', 'うた', 'ちち', 'つき', 'くさ', 'いと', 'けさ', 'せしき',
  'せいと', 'あした', 'そと', 'ちかい', 'すき', 'かてい', 'つくえ', 'すこし',
  'ちいさい', 'おととい'],

  /* Level 3 */
  ['かな', 'あの', 'にく', 'きぬ', 'はこ', 'ふね', 'へた', 'ほし', 'ふえ',
  'はな', 'なに', 'なか', 'くに', 'あに', 'はね', 'あね', 'その', 'はなし',
  'ひすい', 'ふかい', 'ふつか', 'へいき', 'にし', 'ぬう', 'はつか',
  'ひくい', 'ほか', 'ほね', 'なた', 'いぬ', 'あはし', 'ふたつ', 'にかい',
  'あかえ', 'ひとつ', 'ほし', 'あかいはね', 'ほそいあし', 'ちさいふね',
  'へたね', 'はこのなか', 'すきなひと', 'さかな', 'ねこ', 'はし', 'ひと'],

  /* Level 4 */
  ['まち', 'みみ', 'のむ', 'こめ', 'もも', 'へや', 'あゆ', 'よむ', 'うめ',
  'くも', 'やね', 'ゆか', 'よい', 'あやつ', 'まえ', 'せまい', 'あたま',
  'つつむ', 'むかし', 'やすみ', 'やさしい', 'いま', 'かみ', 'うみ', 'むし',
  'かいもの', 'やま', 'ゆき'],

  /* Level 5 */
  ['そら', 'もり', 'はる', 'これ', 'しろ', 'はん', 'それ', 'とり', 'てら',
  'きらい', 'つり', 'となり', 'らるい', 'みる', 'れきし', 'かれ', 'ひろい',
  'うしろ', 'かいわ', 'わかい', 'みんあ', 'かんたん', 'さくら', 'あさら',
  'はり', 'くろい', 'きいろい', 'ところ', 'くすり', 'くるま', 'しろい',
  'かわ', 'ほん', 'みかん', 'しんかんせん'],

  /* Level 6 */
  ['おんがく', 'てがみ', 'たまご', 'かぎ', 'みず', 'ふじさん', 'ちず',
  'かぞく', 'にほんご', 'あさごはん'],

  /* Level 7 */
  ['くだもの', 'でんわ', 'こでも', 'かばん', 'ばんごはん', 'そろばん',
  'はなび', 'しんぶん', 'たべもの', 'ぼく'],

  /* Level 8 */
  ['えんぴつ', 'てんぷら']

];

